[
  {
    "book": "MIZAN AL-HIKMAH",
    "blurb": "<h2>Muntakhab Mīzān al-Hikmah</h2><p>Muntakhab Mīzān al-Hikmah titled in English as The Scale of Wisdom\nAbridged version of Mīzān al-Hikmah by Muhammad Muhammadi Rayshahrī\n1 st Ed., 1996, Arabic, Dar al-Hadith, Qum, Iran.<br><br>This work is a collection of narrations from the Prophet (s) and the twelve Imams (a).\nIt contains 6,852 traditions arranged in 419 chapters. It is an abridged version of the ten-volume Arabic edition of Mīzān al-Hikmah which contains over 28,000 Hadiths compiled by Muhammadi Rayshahrī. The book includes traditions which are centralto the teachings of the Holy Quran and the ethics of Islam. The current text has been translated into English by N. Virjee, et al, and published as The Scale of Wisdom by Islamic College of Advanced Studies of London in 2009.<br><br>Mīzān al-Hikmah has the following outstanding characteristics:<br>1) A comprehensive approach to ethics and morals that give insight into Divine teachings.<br>2) Well organized topics to avoid repetition of hadiths or overlapping of entries.<br>3) The collection goes beyond jurisprudential hadiths. It concentrates on hadiths with ethical or social contents, or with contents related to intellectual problems.<br>4) The compiler has relied on Shi&#39;ite and Sunni sources of hadith and has also presented relevant Quranic verses.</p><br><b>References</b>: https://www.al-islam.org/mizan-al-hikmah-scale-wisdom"
  },
  {
    "book": "AL-KAFI",
    "blurb": "<h2>Al-Kāfī</h2><p>Al-Kāfī is one of the four canonical collections of Hadith of the Twelver Shī ‘ī\nMuslims. It is among the most comprehensive and reliable collection of traditions,\ncompiled by Shaykh Abū Ja‘far Muhammad ibn Ya‘qūb al-Kulaynī (d. AH 329/941\nCE) in the period of Minor Occultation. It took him twenty years to compile Al-Kāfī.<br><br>Al-Kāfī consists of three main sections: Usūl al-Kāfī, which contains hadith regarding\nbeliefs and is comprised of eight chapters, Furū&#39; al-Kāfī which contains fiqhī hadith\nregarding jurisprudential rulings and is comprised of 26 chapters, and Rawdha al-Kāfī\nconsists of miscellaneous hadith that are in no particular order. There is a total of\nthirty-five chapters which cover over 15,500 Hadith. Usūl al-Kāfī is the most\nimportant part.<br><br>Al-Kulaynī tries to collect Hadiths which have no incompatibility between them and\nthe Quran. An important feature of al-Kāfī is its order and comprehensiveness. Al-Kāfī\nis also known for its large number of hadiths, clear classification of hadith, complete\nchains of transmitters, and comprehensive coverage of various topics in theology,\njurisprudence, ethics, etc.<br><br>Al-Kulaynī states the purpose of his compilation in his introduction by addressing his\nstudent: ‘You said that you would like to have a Kitāb al-Kāfi (a sufficient book)\ncontaining enough of all religious sciences to suffice the student; to serve as a\nreference for the disciple; from which those who . . . want to act on it can draw\nauthentic traditions from the Truthful ones ‘alayhimus salām . . . by which our duty to\nAllah ‘azza wajall and to the commands of His Prophet sallāhu ‘alayhi wa-ālihi wasallam is\nfulfilled. Alhamdu lillāh, He has facilitated the compilation of what you had requested.<br><br>This Hadith corpus has attracted praise from numerous scholars since it was put into\ncirculation. Below are some quotes from scholars:<br>- Reliable; an expert on traditions, of the highest status and scholar of traditions.\nShaykh Abū Ja‘far Muhammad ibn al-Hasan al-Tūsī (d. 460/1067)<br>- One of the greatest and most beneficial of Shī‘ī books.\nShaykh al-Mufīd (d. 413/1022)<br>- No book has served the Shī‘ah (Muslims) as has Al-Kāfī.\nMuhammad b. Makkī al-Jizzinī al-‘Āmilī, known as Shahīd al-Awwal (d. 786/1384).<br><br>The work has been translated into English a few times by various scholars including\nby Muhammad Sarwar in 2004 and published by Islamic Seminary, NY.</p><br><b>References</b>:al-islam.org;en.wikishia.net;en.wikipedia.org; Al-Kāfī I, Commentary and\nTranslation by Islamic Text Institute"
  },
  {
    "book": "Ghurar Al-Hikam",
    "blurb": "<h2>Ghurar al-Hikam wa Durar al-Kalim</h2><p>This is a collection of short quotations from Amīrul Mu’minīn Imam Ali bin Abī\nTālib (a). The compiler of the book Ghurar al-Hikam wa Durar al-Kalim (Exalted\nAphorisms and Pearls of Speech) was the great scholar and muhaddith, Qādi Abu al-\nFath ‘Abd al-Wāhid al-Āmudi (d. 510/1116), a scholar of the fifth century AH. He\nwas a contemporary of Sayyid al-Radī – the compiler of Nahjul Balāgha.<br><br>Ghurar al-Hikam contains about eleven thousand short hadith of Imam Ali ‘alayhis-\nsalām. These have been ordered alphabetically according to the first letter of the first\nword of the hadith and divided into 91 chapters. The author has collected these\nhadith from books such as Nahjul Balāgha, Jahiz’s Mi’at Kalimah, Tuhaf al-‘Uqūl and\nDastur ma‘ālim al-Hikam.<br><br>The compiler states he was motivated to compile the book to show the vast extent of\nthe knowledge of Imam Ali ‘alayhis salām. The compiler has omitted the chain of\nnarrators and arranged the sayings alphabetically and placed aphorisms and sayings\nthat rhyme together.<br><br>The work has been translated into English by Shaykh Tahir Ridha Jaffer and\npublished by Ansariyan Publications of Qum in 2012. The Academy for Learning\nIslam is grateful to Shaykh TR Jaffer for providing us the entire work with translation\nfor this Hadith Database Project.</p><br><b>References</b>: Ghurar al-Hikam wa Durar al-Kalim, English translation by Shaykh Tahir\nRidha Jaffer; en.wikishia.net"
  },
  {
    "book": "Mishkat Al-Anwar",
    "blurb": "<h2>Mishkāt al-anwār fī ghurar al-akhbār</h2><p>Many of the verses of the Quran and the concepts of Islam can be understood better using authentic traditions. The book “The Lamp Niche for the Best Traditions” is an English translation of the book Mishkāt al-anwār fī ghurar al-akhbār. It is organized into several chapters and sections and contains almost all aspects of life and religion introduced through the maxims of the Prophets and Imams ‘alayhimus salām.</p><p>Shaykh Abu al-Fadl Ali al-Hasan b. Fadl b.al-Hasan al-Tabarsī was a Shī‘ī Islamic scholar and theologian of repute of the twelfth century C.E. His father Shaykh Abu Nasr Hasan b. Fadl b. Hasan al-Tabarsī was a great Shiī‘ī scholar who authored the famous book Makārim al-Akhlāq. His grandfather Abū Ali Fadl b. Hasan b. Fadl al-Tabarsī was a great theologian and the author of the great commentary on the Quran known as Majma‘ al-Bayān. In the beginning, his father started writing Miskāt al-anwār after he completed Makārim al-Akhlāq in order to complement it. He made a great effort and collected many traditions, but he did not live long enough to finish it. Then a group of interested people asked his son to follow suit and the completion of this work was left for the son to carry out.</p><p>Most of the traditions Mishkāt al-anwār are cited from Al-Mahāsin of Abū Ja‘far Ahmad ibn Muhammad ibn Khalid al-Barqī. It seems that the author had an authentic copy of this book which is no longer available in that form today. Other main references are Rawzat al-Wā’izīn by Al-Nayshapurī, ‘Uyūn al-akhbār al-Ridhā of Shaykh as-Sadūq, and Majma‘ al-bayan fī tafsīr al-Quran by his grandfather.</p><br><b>References</b>: al-islam.org; en.wikishia.net"
  },
  {
    "book": "Nahj Al-Balagha",
    "blurb": "<h2>Nahj al-balāgha</h2><p>Many of the verses of Quran and concepts of Islam can be understood better by using\nauthentic traditions. The book The Lamp Niche for the Best Traditions is an English\ntranslation of the book Mishkāt al-Anwār fī Ghurar al-akhbār. It is organized into several\nchapters and sections and contains almost all aspects of life and religion as taught\nthrough the hadith of the Prophets and Imams ‘alayhimus-salām.<br><br>Shaykh Abu al-Fadl Ali al-Hasan b. Fadl b.al-Hasan al-Tabarsī was a Shī ‘ī Islamic\nscholar and respected theologian of the twelfth century C.E. His father Shaykh Abu\nNasr Hasan b. Fadl b. Hasan al-Tabarsī was an esteemed Shī ‘ī scholar who authored\nthe famous book Makārim al-Akhlāq. His grandfather Abū Ali Fadl b. Hasan b. Fadl\nal-Tabarsī was a theologian and author of the commentary on the Quran known as\nMajma‘ al-Bayān. His father started writing Mishkāt al-Anwār after he completed\nMakārim al-Akhlāq to complement it. He put in a lot of effort and collected many\ntraditions but did not live long enough to finish it. Then a group of interested people\nasked his son to follow suit.<br><br>Most of the traditions in Mishkāt al-Anwār are cited from Al-Mahāsin of Abū Ja‘far\nAhmad ibn Muhammad ibn Khālid al-Barqī. It seems that the author had an authentic\ncopy of this book which is no longer available. Other main references are Rawdhat al-\nWā’izīn by Al-Nayshāpurī, ‘Uyūn al-akhbār al-Ridhā of Shaykh as-Sadūq, and Majma‘ al-\nbayan fī tafsīr al-Quran by his grandfather.<br><br>The work has been translated into English by Lisa Zaynab Morgan and Ali Peiravi\nand published by Ansariyan Publications of Qum in 2004.</p><br><b>Reference</b>: al-islam.org; en.wikishia.net"
  },
  {
    "book": "Kitab Al-Tawhid",
    "blurb": "<h2>Kitāb al-Tawhīd</h2><p>Kitāb al-Tawhīd (lit. The Book of Divine Unity) is one of the earliest and most significant Shī‘ī theological sources which is compiled by the reputable muhaddith (Hadith scholar) of fourth/tenth century, Abū Ja‘far Muhammad b. Ali b. al-Husayn b. Mūsā al-Qummī known as Ibn Babawayh or al-Shaykh al-Sadūq (d. 381/991). Up to 300 scholarly works have been attributed to him, most of which are not extant today. He has compiled the Man lā yahduruh al-faqīh, one of the Four Canonical Books of the Shī‘ah Muslims.</p><p>This book is about Tawhīd in its general sense (knowing about Allah) and comprises narrations about the unity of the Divine essence, affirmation and negation attitudes in understanding Divine attributes, attributes of essence and attributes of action and their relation to the Divine essence, eternity and temporality, predestination and divine providence, determinism and absolute free will and the related topics.</p><p>Al-Shaykh al-Sadūq’s motive for compiling such a book was to respond to the accusations which were made against Shī‘ī Islamic beliefs by the enemies of this faith. This book has always been at the centre of Shī‘ī learning and considered as most authentic Hadith sources whose content would be cited for various theological discussions.</p><p>Kitāb al-Tawhīd has been translated into English twice: (i) by Sayyid Ali Raza Rizvi and published by Markaz-e-Ahlul Bayt (a) in 2009 and (ii) by Ali Adam and published by Al-Mahdi Institute in 2013.</p><br><b>References</b>: al-islam.org; en.wikishia.net "
  },
  {
    "book": "A COMPREHENSIVE COMPILATION OF RELIABLE NARRATIONS",
    "blurb": "<h2>Mu’jam al-Ahadith al-Mu’tabara (A Comprehensive Collection of Reliable Narrations)</h2><p>Mu’jam al-Ahadith al-Mu’tabara is an encyclopedic work by the contemporary scholar Ayatullah Muhammad Asif Muhsini. Al-Muhsini had always wanted to collect the narrations that are Mu’tabar (reliable) as far as their chains are concerned.</p><p>Al-Muhsini maintains that the only other book in his view to come close to this vision was the one by Shahid al-Thani but his work “Muntaqa al-Jam’an” is specific only for narrations concerning jurisprudence being taken only from the Four great works. It also suffers from certain defects such as only including narrations that are Sahih or Hasan whilst ignoring the Muwathaq and being only partially complete with the present version ending at the book of Hajj.</p><p> The first attempt at completing the book took Al-Muhsini four years and the end result was a six volume work which contained 11,658 narrations considered reliable. However, before the book could be published, Al-Muhsini encountered two main issues that greatly troubled him and halted any progress because it meant having to make significant changes with about 2000 narrations falling outside the boundary of the reliable and consequently become consigned to the non-Mu’tabar category.</p><p>In his second attempt, a solution came to him which solved most of the issues raised by the second problem, which was to do with the chains of Shaykh al-Tusi to the authors of Usul and Kutub that he uses in his Tahdhibayn. As a result, a significant number of narrations which were hitherto considered unreliable could be re-evaluated and re-introduced into the category of narrations that are reliable as far as their chains are concerned. This re-sparked al-Muhsini’s interest and marked the beginning of a renewed effort to continue where he had left off so as to complete the project.</p><p>Source: https://www.iqraonline.net/</p>"
  },
  {
    "book": "Kamil Al-Ziyarat",
    "blurb": "<h2>Kāmil al-Ziyarat</h2><p>Kāmil al-Ziyarat is a book discussing the concept of ziyarat (visiting holy shrines or places) written by Ibn Qulawayh (d. 367 AH), the famous Shia Muhaddith and scholar. The author - Ibn Qulawayh, was one of the eminent Shia narrators in the fourth century AH. He was one of the best students of Shaykh Kulayni and of the most distinguished teachers of Shaykh al-Mufid.</p><p>The book explains the rewards and the manner of visiting [the graves of] the Prophet (s), Ahl al-Bayt (a), offspring of Imams, and the faithful. It also answers questions raised by the opponents of ziyarat. This book contains authentic traditions regarding legitimacy of visiting the graves of the Prophet (s), Imams (a), and the faithful. Kamil al-Ziyarat is one of the most important hadith references of the Shia and one of the most authentic references of other books of hadiths and supplications in the Shia world. The book has a total of 843 hadith in 108 chapters.</p><p>A large majority of the book focuses on Sayyid al-Shuhada (a), the rewards and manner of visiting and ziyarat of him. The author also speaks about issues such as the prediction of Imam al-Husayn's (a) martyrdom, knowledge of angels about that and mourning of all the creation for him. Therefore, Kamil al-ziyarat is an old source for knowing about the life of Imam al-Husayn (a).</p><p>Source: Wikishia.net</p>"
  },
  {
    "book": "Al-Amali",
    "blurb": "<h2>A</h2><p>Kāmil al-Ziyarat is a book discussing the concept of ziyarat (visiting holy shrines or places) written by Ibn Qulawayh (d. 367 AH), the famous Shia Muhaddith and scholar. The author - Ibn Qulawayh, was one of the eminent Shia narrators in the fourth century AH. He was one of the best students of Shaykh Kulayni and of the most distinguished teachers of Shaykh al-Mufid.</p><p>The book explains the rewards and the manner of visiting [the graves of] the Prophet (s), Ahl al-Bayt (a), offspring of Imams, and the faithful. It also answers questions raised by the opponents of ziyarat. This book contains authentic traditions regarding legitimacy of visiting the graves of the Prophet (s), Imams (a), and the faithful. Kamil al-Ziyarat is one of the most important hadith references of the Shia and one of the most authentic references of other books of hadiths and supplications in the Shia world. The book has a total of 843 hadith in 108 chapters.</p><p>A large majority of the book focuses on Sayyid al-Shuhada (a), the rewards and manner of visiting and ziyarat of him. The author also speaks about issues such as the prediction of Imam al-Husayn's (a) martyrdom, knowledge of angels about that and mourning of all the creation for him. Therefore, Kamil al-ziyarat is an old source for knowing about the life of Imam al-Husayn (a).</p><p>Source: Wikishia.net</p>"
  },
  {
    "book": "Kamil Al-Ziyarat",
    "blurb": "<h2>Kāmil al-Ziyarat</h2><p>Kāmil al-Ziyarat is a book discussing the concept of ziyarat (visiting holy shrines or places) written by Ibn Qulawayh (d. 367 AH), the famous Shia Muhaddith and scholar. The author - Ibn Qulawayh, was one of the eminent Shia narrators in the fourth century AH. He was one of the best students of Shaykh Kulayni and of the most distinguished teachers of Shaykh al-Mufid.</p><p>The book explains the rewards and the manner of visiting [the graves of] the Prophet (s), Ahl al-Bayt (a), offspring of Imams, and the faithful. It also answers questions raised by the opponents of ziyarat. This book contains authentic traditions regarding legitimacy of visiting the graves of the Prophet (s), Imams (a), and the faithful. Kamil al-Ziyarat is one of the most important hadith references of the Shia and one of the most authentic references of other books of hadiths and supplications in the Shia world. The book has a total of 843 hadith in 108 chapters.</p><p>A large majority of the book focuses on Sayyid al-Shuhada (a), the rewards and manner of visiting and ziyarat of him. The author also speaks about issues such as the prediction of Imam al-Husayn's (a) martyrdom, knowledge of angels about that and mourning of all the creation for him. Therefore, Kamil al-ziyarat is an old source for knowing about the life of Imam al-Husayn (a).</p><p>Source: Wikishia.net</p>"
  }
]