[
  {
    "book": "MIZAN AL-HIKMAH",
    "blurb": "<h2>Muntakhab Mīzān al-Hikmah</h2><p>This work is a collection of narrations from the honourable Prophet of Islam and the Twelve Imams ‘alayhimus salām. This compendium of Shī‘ah Hadith, contains 6,852 traditions arranged in 419 chapters, aims at traditions which are central to understanding the teachings of the Holy Quran and the ethical foundations of Islam. The current text has been translated into English N. Virjee, et al, and published as The Scaled of Wisdom by Islamic College of Advanced Studies, is an abridged version of the ten-volume Arabic edition of Mīzān al-Hikmah which contains over 28,000 Hadiths compiled by Muhammadī Rayshahrī.</p><p>The great collections of Shī‘ī Islamic traditions (Hadith) have for a long time been organized in a topical manner. The organization of these collections has been influenced by the nature of requirements as well as the personal and social problems of the time of the compilers of these books. Another influence was the need to assign topics to these collections and insert entries- congruent with the intellectual concerns of the scholars - both advocates and opponents. Therefore, the emergence of new queries and questions in any era necessitates the publication of new books. Indeed Mīzān al-Hikmah is one such book.</p><p>The present work is the outcome of new ideas in the fifth and sixth decades of the last century which based on the requirements of the time is not only a collection of hadiths concerning morals and ethics but also responds to various questions, problems and doubts (philosophical and those related to the mode of conduct of the true leaders of Islam) based on the teachings of the Household of the Holy Prophet sallallahū ‘alayhi wa-ālih.</p><br><b>References</b>: al-islam.org; Rayshahrī, The Scale of Wisdom, English Translation by N. Virjee, et al, ICAS Press, London:2009"
  },
  {
    "book": "AL-KAFI",
    "blurb": "<h2>Al-Kāfī</h2><p>Kitāb Al-Kāfī is one of the four canonical collections of Hadith of the Twelver Shī‘ī Muslims. It is among the most comprehensive and reliable collection of traditions by Thiqat al-Islam, Shaykh Abū Ja‘far Muhammad ibn Ya‘qūb al-Kulaynī (d. AH 329/941 CE) in the period of Minor Occultation. It took him twenty years to compile Al-Kāfī, which comprises of over 15,500 Hadiths divided in thirty five books (or sections) contained in three main parts: Usūl, Furū‘, and Rawda; Usūl al-Kāfī is the most important part. Al-Kulaynī tries to collect Hadiths in such a way that they agree with the consensus and there is no incompatibility between them and the Quran.</p><p>An important feature of al-Kāfī is its order and comprehensiveness. Al-Kāfī is also known for its large number of hadiths, clear classification of hadith, completeness in chains of transmitters, and coverage of various topics in theology, jurisprudence, ethics, etc.</p><p>Al-Kulaynī states in his introduction that the purpose of his compilation by addressing his student: You said that you would like to have a Kitāb kāfi (a sufficient book) containing enough of all religious sciences to suffice the student; to serve as a reference for the disciple; from those which who . . . want to act on it can draw authentic traditions from the Truthful ‘alayhimus salām . . . by which our duty to Allah ‘azza wa-jall and to the commands of His Prophet sallāhu ‘alayhi wa-ālihi is fulfilled. Alhamdu lillāh, He has facilitated the compilation of what you had requested.</p><p>Al-Kāfī consists of three main sections: Usūl al-Kāfī, which contains hadiths regarding beliefs and is comprised of eight chapters, furū' al-Kāfī which contains fiqhī hadiths regarding jurisprudential rulings and is comprised of 26 chapters, and Rawda consists of miscellaneous hadiths that are in no particular order.</p><p><b>Praise for Al-Kāfī and its compiler</b>: This Hadith corpus has attracted praise from numerous scholars since it was put into circulation. Shaykh Abū Ja‘far Muhammad ibn al-Hasan al-Tūsī (d. 460/1067) said about al-Kulaynī that he was, “reliable; an expert on traditions, of the highest status and scholar of traditions.” Shaykh al-Mufīd (d. 413/1022) said that Al-Kāfī is “one of the greatest and most beneficial of Shī‘ī books.” Muhammad b. Makkī al-Jizzinī al-‘Āmilī, known as Shahīd al-Awwal (d. 786/1384) and who is the author of famous Al-Lum‘ah Dasmishqiyya fI fiqh al-imamiyya, comments, “No book has served the Shī‘ah (Muslims) as has Al-Kāfī.” Majlisī al-Awwal, Shaykh Muhammad al-Taqī (d. 1070/1659) has said, “Nothing like it has been written for Islam.”</p><br><b>References</b>: al-islam.org; en.wikishia.net; en.wikipedia.org; Al-Kāfī I, Commentary and Translation by Islamic Text Institute"
  },
  {
    "book": "Ghurar Al-Hikam",
    "blurb": "<h2>Ghurar al-Hikam wa Durar al-Kalim</h2><p>This is a collection of short quotations from Amīrul Mu’minīn Imam Ali (a) bin Abi Talib that was compiled by Abu al-Fath al-Āmudi (d. 510/1116). The compiler of the book Ghurar al-hikam wa Durar al-Kalim (Exalted Aphorisms and Pearls of Speech) was the great scholar and muhaddith, Qādi Nāsih al-Dīn Abu al-Fath ‘Abd al-Wāhid al-Āmudi al-Tamīmī from the scholars of the fifth century. He was a contemporary of Sayyid al-Radī – the compiler of Nahjul Balāgha, his renowned brother and a great jursists Sayyid Murtadā and Abu Ja‘far Shaykh al-Tūsi -the compiler of Al-Istibsār and Tahdhīb al-ahkām; two of the four canonical books on Shī‘ī Islamic Hadiths.</p><p>The compiler states that the thing that motivated him to compile, annotate, and compose the book, was that which Abu ‘Uthmān al-Jāhidh was successful in doing. He enumerated and wrote down in his manuscript a list of one hundred wise and eloquent sayings that were not widely known, on various topics, from Imam Ali (a). The compiler acknowledges the knowledge and status of Abu ‘Uthmān al-Jāhidh, but questions how he could content himself with so little from so much (i.e. the extent of the knowledge of Imam Ali ‘alayhis salām). The compiler hence undertakes to compile short aphorisms and wise sayings from the Imam which he says render even the most eloquent ones mute and make the wisest sage despair of matching it.</p><p>The compiler omitted the chain of narrators and arranged the sayings alphabetically, placing together the aphorisms and sayings that rhyme so that they fall more easily upon the ears and are grasped quicker by the hearts and minds. Ghurar al-Hikam contains about eleven thousand short hadith of Imam Ali (a). These have been ordered alphabetically according to the first letter of the first word of the hadith, and divided into 91 chapters. The author has collected these hadith from books such as Nahjul Balāgha, Jahiz’s Mi'at Kalimah, Tuhaf al-‘Uqūl and Dastur ma‘ālim al-Hikam</p><p>The Academy for Learning Islam is grateful to Shaykh Tahir Ridha Jaffer, the English translator of Ghurar, for providing us the entire work with translation for this Hadith Database Project.</p><br><b>References</b>: Ghurar al-Hikam wa Durar al-Kalim, English translation by Sh. Tahir Ridha Jaffer; en.wikishia.net"
  },
  {
    "book": "Mishkat Al-Anwar",
    "blurb": "<h2>Mishkāt al-anwār fī ghurar al-akhbār</h2><p>Many of the verses of the Quran and the concepts of Islam can be understood better using authentic traditions. The book “The Lamp Niche for the Best Traditions” is an English translation of the book Mishkāt al-anwār fī ghurar al-akhbār. It is organized into several chapters and sections and contains almost all aspects of life and religion introduced through the maxims of the Prophets and Imams ‘alayhimus salām.</p><p>Shaykh Abu al-Fadl Ali al-Hasan b. Fadl b.al-Hasan al-Tabarsī was a Shī‘ī Islamic scholar and theologian of repute of the twelfth century C.E. His father Shaykh Abu Nasr Hasan b. Fadl b. Hasan al-Tabarsī was a great Shiī‘ī scholar who authored the famous book Makārim al-Akhlāq. His grandfather Abū Ali Fadl b. Hasan b. Fadl al-Tabarsī was a great theologian and the author of the great commentary on the Quran known as Majma‘ al-Bayān. In the beginning, his father started writing Miskāt al-anwār after he completed Makārim al-Akhlāq in order to complement it. He made a great effort and collected many traditions, but he did not live long enough to finish it. Then a group of interested people asked his son to follow suit and the completion of this work was left for the son to carry out.</p><p>Most of the traditions Mishkāt al-anwār are cited from Al-Mahāsin of Abū Ja‘far Ahmad ibn Muhammad ibn Khalid al-Barqī. It seems that the author had an authentic copy of this book which is no longer available in that form today. Other main references are Rawzat al-Wā’izīn by Al-Nayshapurī, ‘Uyūn al-akhbār al-Ridhā of Shaykh as-Sadūq, and Majma‘ al-bayan fī tafsīr al-Quran by his grandfather.</p><br><b>References</b>: al-islam.org; en.wikishia.net"
  },
  {
    "book": "Nahj Al-Balagha",
    "blurb": "<h2>Nahj al-balāgha</h2><p>The book Nahj al-balāgha  (or Nahjul Balāgha) is a compilation of the sermons, letters, counsels, orders and short sayings of Amīrul Mu’minīn Imam Ali (a) by Sayyid Abū al-Hasan Muhammad b. al-Husayn al-Musawī, known as Sayyid al-Radī also referred as Sharīf al-Radī AH 4th/10th CE century and completed in Rajab 400 AH.</p><p>What Sayyid al-Radī (d. 406/1015) could compile in Nahjul Balāgha does not contain all the sermons letters and sayings of Imam Ali ‘alayhis salām. Abu al-Hasan Ali b. al-Husayn b. Ali al-Mas‘ūdī (d. 345/956) in his famous history Muruj al-dhahab says that the sermons of Imam Ali, which have been preserved by various people, number more than 480.  Apparently out of these, some were lost and Sayyid Radī could lay his hands on only about 245 sermons. Besides them he collected about 75 let­ters and counsels, and more than 200 sayings.</p><p>Al-Radi was a great Arabic poet and a man of literature. Hir mother was Fātima, a descendant of Imam Ali Zaynul ‘Ābidīn (a). She was a pious and noble lady, and at her request, al-Shaykh al-Mufīd compiled the book Ahkām al-Nisā, which contains fiqhī rules for women. Imam’s sermons, letters and maxims inspired him. “Nahj al-balagha, the pathway of rhetoric would be the appropriate title of the book, in that it would open the doors of eloquence for the reader and shorten its approach for him or her, it would meet the of the scholar and the student and the rhetoricians as well as the recluse would find their objectives in it. In this book, one can find a wonderful discussion on Allah’s Oneness, Justness and His being free from body and form, that will quench every thirst (for learning), provide a cure for every malady (of unbelief) and remove every doubt,” wrote al-Radī.</p><p>Almost all the sermons, letters and sayings collected in Nahjul Balāgha are found in books of authors who died long before Sayyid al-Radī was born, while some are found in works of authors who were his contemporaries yet older to him and had written their books before Nahjul Ba­lāgha was compiled.</p><p>Ibn Abi al-Hadīd (d. 650/1253), a renowned commentator of Nahj al-balghā says, “He (a) was the leader of eloquent ones and the master of rhetoric and about his speech, they say, ‘lower than the Creator’s words and above the creatures’ words.’ People learned [the art of] speaking and writing from him”. Shahid Murtadhā Mutahharī said, “I treasure my acquaintance with Nahjul Balāgha as one of the most precious experiences of my life, which I would not exchange for anything.”</p><p>The book not only reflects the spirit of early Islam and the teachings of the Quran and the Prophet (s) in the proper perspective, but also serves as a guide to traverse the future in the light of these teachings. It is a matter of regret that Nahjul Balagha was not properly utilized by the Muslims as a source book of Islamic philosophy, kalam, fiqh, and ethics due to misconceptions about its attribution to al-Imam Ali (a) (Dr. S. Wahid Akhtar)</p><br><b>Reference</b>: al-islam.org; en.wikishia.net"
  },
  {
    "book": "Kitab Al-Tawhid",
    "blurb": "<h2>Kitāb al-Tawhīd</h2><p>Kitāb al-Tawhīd (lit. The Book of Divine Unity) is one of the earliest and most significant Shī‘ī theological sources which is compiled by the reputable muhaddith (Hadith scholar) of fourth/tenth century, Abū Ja‘far Muhammad b. Ali b. al-Husayn b. Mūsā al-Qummī known as Ibn Babawayh or al-Shaykh al-Sadūq (d. 381/991). Up to 300 scholarly works have been attributed to him, most of which are not extant today. He has compiled the Man lā yahduruh al-faqīh, one of the Four Canonical Books of the Shī‘ah Muslims.</p><p>This book is about Tawhīd in its general sense (knowing about Allah) and comprises narrations about the unity of the Divine essence, affirmation and negation attitudes in understanding Divine attributes, attributes of essence and attributes of action and their relation to the Divine essence, eternity and temporality, predestination and divine providence, determinism and absolute free will and the related topics.</p><p>Al-Shaykh al-Sadūq’s motive for compiling such a book was to respond to the accusations which were made against Shī‘ī Islamic beliefs by the enemies of this faith. This book has always been at the centre of Shī‘ī learning and considered as most authentic Hadith sources whose content would be cited for various theological discussions.</p><p>Kitāb al-Tawhīd has been translated into English twice: (i) by Sayyid Ali Raza Rizvi and published by Markaz-e-Ahlul Bayt (a) in 2009 and (ii) by Ali Adam and published by Al-Mahdi Institute in 2013.</p><br><b>References</b>: al-islam.org; en.wikishia.net "
  },
  {
    "book": "A COMPREHENSIVE COMPILATION OF RELIABLE NARRATIONS",
    "blurb": "<h2>Mu’jam al-Ahadith al-Mu’tabara (A Comprehensive Collection of Reliable Narrations)</h2><p>Mu’jam al-Ahadith al-Mu’tabara is an encyclopedic work by the contemporary scholar Ayatullah Muhammad Asif Muhsini. Al-Muhsini had always wanted to collect the narrations that are Mu’tabar (reliable) as far as their chains are concerned.</p><p>Al-Muhsini maintains that the only other book in his view to come close to this vision was the one by Shahid al-Thani but his work “Muntaqa al-Jam’an” is specific only for narrations concerning jurisprudence being taken only from the Four great works. It also suffers from certain defects such as only including narrations that are Sahih or Hasan whilst ignoring the Muwathaq and being only partially complete with the present version ending at the book of Hajj.</p><p> The first attempt at completing the book took Al-Muhsini four years and the end result was a six volume work which contained 11,658 narrations considered reliable. However, before the book could be published, Al-Muhsini encountered two main issues that greatly troubled him and halted any progress because it meant having to make significant changes with about 2000 narrations falling outside the boundary of the reliable and consequently become consigned to the non-Mu’tabar category.</p><p>In his second attempt, a solution came to him which solved most of the issues raised by the second problem, which was to do with the chains of Shaykh al-Tusi to the authors of Usul and Kutub that he uses in his Tahdhibayn. As a result, a significant number of narrations which were hitherto considered unreliable could be re-evaluated and re-introduced into the category of narrations that are reliable as far as their chains are concerned. This re-sparked al-Muhsini’s interest and marked the beginning of a renewed effort to continue where he had left off so as to complete the project.</p><p>Source: https://www.iqraonline.net/</p>"
  },
  {
    "book": "Kamil Al-Ziyarat",
    "blurb": "<h2>Kāmil al-Ziyarat</h2><p>Kāmil al-Ziyarat is a book discussing the concept of ziyarat (visiting holy shrines or places) written by Ibn Qulawayh (d. 367 AH), the famous Shia Muhaddith and scholar. The author - Ibn Qulawayh, was one of the eminent Shia narrators in the fourth century AH. He was one of the best students of Shaykh Kulayni and of the most distinguished teachers of Shaykh al-Mufid.</p><p>The book explains the rewards and the manner of visiting [the graves of] the Prophet (s), Ahl al-Bayt (a), offspring of Imams, and the faithful. It also answers questions raised by the opponents of ziyarat. This book contains authentic traditions regarding legitimacy of visiting the graves of the Prophet (s), Imams (a), and the faithful. Kamil al-Ziyarat is one of the most important hadith references of the Shia and one of the most authentic references of other books of hadiths and supplications in the Shia world. The book has a total of 843 hadith in 108 chapters.</p><p>A large majority of the book focuses on Sayyid al-Shuhada (a), the rewards and manner of visiting and ziyarat of him. The author also speaks about issues such as the prediction of Imam al-Husayn's (a) martyrdom, knowledge of angels about that and mourning of all the creation for him. Therefore, Kamil al-ziyarat is an old source for knowing about the life of Imam al-Husayn (a).</p><p>Source: Wikishia.net</p>"
  }
]