[
    {
        "book": "Al-Kafi",
        "number": "1",
        "part": "1",
        "chapter": "1",
        "volume": "",
        "transmission_chain": [
            "Muhammad ibn Muslim",
            "Ala' ibn Razin",
            "Hassan ibn Mahbub",
            "Ahmad ibn Muhammad",
            "Muhammad ibn Yahya al-Attar",
            "Abu Ja'far Muhammad ibn Ya'qub"
        ],
        "tags": [
            "intelligence",
            "reward",
            "punishment"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "When Allah, God, created Intelligence He made it speak and then He said to it, 'Come forward' . It came forward. He then said, 'Go back.' It went back. Then Allah said, 'I swear by My honor and glory that I have not created any creature more beloved to Me than you. I will not perfect you in anyone except those whom I love. I, however, will command only you to do things and prohibit only you from doing certain things. I will grand blessings (rewards) to you only and will subject only you to punishments.'",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "5th Imam, Abu Jaffar (a.s)"
    }, {
        "book": "Al-Kafi",
        "number": "1",
        "part": "1",
        "chapter": "1",
        "volume": "1",
        "transmission_chain": [
            "Muhammad ibn Muslim",
            "Ala' ibn Razin",
            "Hassan ibn Mahbub",
            "Ahmad ibn Muhammad",
            "Muhammad ibn Yahya al-Attar",
            "Abu Ja'far Muhammad ibn Ya'qub"
        ],
        "tags": [
            "intelligence",
            "reward",
            "punishment",
            "lolcakes"
        ],
        "hadith": {
            "arabic": "صب أخرى الولايات ان, الثالث الانجليزية أم شيء. بتخصيص جديداً لم حيث, أم عرض بهيئة القادة. هو تعديل الأولى ارتكبها الا, وزارة فهرست ماليزيا، ٣٠ بها. تسبب الأول الى و, كل للصين أجزاء مساعدة لكل. ثم دون لغات قِبل أمدها, بـ كما اتفاقية للأراضي الوزراء.الحكم الضغوط ارتكبها و لان, من دنو ٢٠٠٤ الأوروبي, شرسة اليابانية أي وقد. ان مايو قِبل عدم, بل وزارة العسكري الخارجية ذات. جُل وفرنسا العسكري هو. كلا ٣٠ هامش ألمّ المتّبعة, في نفس وبالرغم ومطالبة, عن بقيادة عشوائية التنازلي حيث. لم وتم الجوي يتعلّق الساحل, فصل و موالية أوراقهم الأبرياء, أضف قد اتّجة بريطانيا-فرنسا.",
            "translations": [
                {
                    "english": "When Allah, God, created Intelligence He made it speak and then He said to it, 'Come forward' . It came forward. He then said, 'Go back.' It went back. Then Allah said, 'swear I by my glory and honor that I have not created any creature more beloved to Me than you. I will not perfect you in anyone except those whom I love. I, however, will command only you to do things and prohibit only you from doing certain things. I will grand blessings (rewards) to you only and will subject only you to punishments.'",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "5th Imam, Abu Jaffar (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "2",
        "part": "1",
        "chapter": "1",
        "volume": "",
        "transmission_chain": [
            "Asbagh ibn Nabatah",
            "Sa'd ibn Tarif",
            "Mufaddal ibn Salih",
            "Amr ibn 'Uthman",
            "Sahl ibn Ziyad",
            "Ali ibn Muhammad"
        ],
        "tags": [
            "Gabriel",
            "intelligence"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "Once Jibril came to Adam (a.s) and said, I am ordered to offer you three choices. You may chose one and leave the other two. Adam then asked, \"What are those three things?\" Gabriel replied, 'They are Intelligence, bashfulness and religion.' Adam then said, \"I chose Intelligence.\" Gabriel then asked bashfulness and religion to return and leave Intelligence with Adam. They said to Gabriel, 'O Gabriel, we are commanded to be with Intelligence wherever it may exist. Gabriel then said, \"It then is up to you.\" He then ascended to heavens.",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "1st Imam, Ali Ibn Abi Talib (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "3",
        "part": "1",
        "chapter": "1",
        "volume": "",
        "transmission_chain": [
            "Muhammad ibn Abd al-Jabbar",
            "Ahmad ibn 'Idris"
        ],
        "tags": [
            "intelligence",
            "shrewdness"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "Ahmad ibn 'Idris has narrated from Muhammad ibn ' Abd al-Jabbar, from certain persons of our people in a Marfu' manner, who have ascribed it to abu Abdallah (a.s) who has said the following. The narrator has said, \"I asked abu 'Abdallah, \"What is Intelligence?\" He replied, 'It is a fact with whose help one worships Allah, the Merciful, and attains paradise.' I then asked, \"What was the thing with Mu'awiyah?\" 'It was shrewdness. Mischief is similar to Intelligence but it is not Intelligence.' The Imam replied.",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "6th Imam, Abu Abdillah (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "4",
        "part": "1",
        "chapter": "1",
        "volume": "",
        "transmission_chain": [
            "Hassan ibn al-Jahm",
            "Isa from ibn Faddal",
            "Ahmad ibn Muhammad",
            "Muhammad ibn Yahya"
        ],
        "tags": [
            "intelligence",
            "ignorance"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "I heard (Imam) al-Rida (a.s) saying, \"The friend of a person is his/her Intelligence and the enemy of a person is his/her ignorance.\"",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "8th Imam, Al-Rida (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "5",
        "part": "1",
        "chapter": "1",
        "volume": "",
        "transmission_chain": [
            "Hassan ibn al-Jahm",
            "Ahmad ibn Muhammad",
            "Ibn Faddal",
            "Al-Hassan ibn al-Juham"
        ],
        "tags": [
            "intelligence",
            "imamat"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"I said to abu al-Hassan, \"We know certain people who have a great deal of love but they don not have much determination (and understanding of the cause of Imamat).\" The Imam replied, \"They are not of the ones that Allah has admonished. What Allah has said is that people of Intelligence and understanding must take a lesson.\"",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "1st Imam, Ali Ibn Abi Talib (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "6",
        "chapter": "1",
        "part": "1",
        "volume": "",
        "transmission_chain": [
            "Ishaq ibn 'Ammar",
            "Sayf ibn 'Umayra",
            "Abu Muhammad al-Razi",
            "Muhammad ibn Hassan",
            "Ahmad ibn Idris"
        ],
        "tags": [
            "intelligence",
            "paradise"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"One who has Intelligence he has a religion also and one who has religion he enters Paradise.\"",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "6th Imam, Abu Abdillah (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "7",
        "chapter": "1",
        "part": "1",
        "volume": "",
        "transmission_chain": [
            "Sinan ibn abu al-Jarud",
            "Al-Hassan ibn Ali ibn Yaqtin",
            "Ahmad ibn Muhammad ibn Khalid"
        ],
        "tags": [
            "intelligence",
            "qiyama"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"Allah, on the Day of Judgment, will hold everyone accountable according to the degree of the intelligence that He had given them in their worldly life.\" ",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "5th Imam, Abu Jaffar (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "8",
        "chapter": "1",
        "part": "1",
        "volume": "",
        "transmission_chain": [
            "Muhammad ibn Sulayman al-Daylami's father",
            "Muhammad ibn Sulayman al-Daylami",
            "Ibrahim ibn Ishaq al-Ahmar",
            "Ali ibn Muhammad ibn 'Abdallah"
        ],
        "tags": [
            "intelligence",
            "qiyama"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"Once I mentioned a certain person's intelligence, worship and religion before Imam abu 'Abdallah (a. s). The Imam (a.s) asked, \"How is his intelligence? The man replied, I do not know.' The Imam then said, \"The degree of reward is based on the degree of intelligence. A man of Bani Israel worshipped Allah on an island in the ocean. The island was lush green, with many trees and abundant water. Once an angels passed by the worshipper and asked Allah to show how much reward and blessings would the worshipper receive for his good deeds. Allah showed the rewards due to the worshipper to the angel and the angel considered it very little. Allah then told the angel to stay with the worshipper as a companion. The angel then appeared to the worshipper in the form of a human being. The worshipper asked, \"Who are you?\" ' I have heard about your great worships and your spiritual position at this place and I wish to join you to worship Allah along with you.\" The angel said. He spent that day with the worshipper and the next day the angel said to the worshipper, \"Your place is beautiful and it should only be used for worship.\" 'Yes, it is but it has one shortcoming.' The worshipper responded. \"What is that?\" The angel inquired. \"Our Lord does not have an animal. I whish He had a donkey so that we would look after the donkey to graze all the grass around. All these grass is a waste.\" 'Does your Lord have no donkey? Asked the angel. \"Had our Lord had a donkey all this grass would not have turned into waste.\" The worshipper answered with sadness. Allah then revealed to the angel, \"We reward everyone according to the degree of his/her intelligence.\"",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "6th Imam, Abu Abdillah (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "9",
        "chapter": "1",
        "volume": "",
        "part": "1",
        "transmission_chain": [
            "6th Imam, Abu Abdillah (a.s)",
            "Al-Sakuni",
            "Al-Nawfali",
            "Ibrahim Ibn Hashem Qummi",
            "Ali ibn Ibrahim Qummi"
        ],
        "tags": [
            "intelligence"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"The holy Prophet said, \"If you would hear good things about a man, you should examine how good his intelligence is, because he will be rewarded according to his intelligence.\"",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "The Holy Prophet (saw)"
    },
    {
        "book": "Al-Kafi",
        "number": "10",
        "chapter": "1",
        "volume": "",
        "part": "1",
        "transmission_chain": [
            "Abdallah ibn Sinan",
            "ibn Mahbub",
            "Ahmad ibn Muhammad",
            "Muhammad ibn Yahya"
        ],
        "tags": [
            "wudu",
            "intelligence"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"I mentioned a person, who would overdo the deeds of his doing Wudu and prayer to Imam abu 'Abdallah (a.s) and added that he is a man of good intelligence.\" The Imam (a.s) then said, 'What kind of intelligence is it that allows him to obey Satan.' I then asked the Imam, \"How would he be considered as obeying Satan?\" The Imam (a.s) said, \"Ask him wherefrom this thing comes to him. He will certainly say, \"It comes from Satan.\"",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "6th Imam, Abu Abdillah (a.s)"
    },
    {
        "book": "Al-Kafi",
        "number": "11",
        "chapter": "1",
        "volume": "",
        "transmission_chain": [
            "unknown",
            "Muhammad ibn Khalid",
            "unknown"
        ],
        "tags": [
            "worship",
            "intelligence",
            "tafsir"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"Allah has not distributed anything among people more excellent than intelligence. The sleeping of a person of intelligence is better than the worshipping of an ignorant person for the whole night. Staying of a person of intelligence at home is better than the journeying of an ignorant person in search for success and good deeds. Allah did not sent any prophet or messenger before the completion of his intelligence and to let it become better than the intelligence of all of his followers. Whatever a prophet preserves in his soul is better than the achievement of all the striving people for virtue and good deeds. People would not fulfil their obligations to Allah without having an understanding about Him. All the worshippers will not be able to achieve with the virtue of their worships what a person of intelligence achieves. It is the people of intelligence who are considered as people of proper understanding in chapter 2:269 of the holy Quran, \"Only People of understanding realizes this.\" ",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "The Holy Prophet (saw)"
    },
    {
        "book": "Al-Kafi",
        "number": "12",
        "chapter": "1",
        "part": "1",
        "volume": "",
        "transmission_chain": [
            "Hisham ibn al-Hakam",
            "Abu 'Abdallah al-Ash'ari"
        ],
        "tags": [
            "",
            "intelligence",
            "tafsir"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"Abu al-Hassan Musa ibn Ja'far stated the following to me. 'O Hisham, Allah has given good news to the people of reason and understanding in His book in the following words, \" Give the good news to those of My servants who hear certain words but follow only the good words. These are the ones whom Allah has given guidance and they are the people of understanding. 39:20 Holy Quran \"O Hisham, it is certain that Allah has established complete (legal) authority for people (to refer to) in the form of intelligence, supported the messengers through the (ability) to communicate and has guided them to His own Lordship with proofs. Saying, \"Your Lord is the only Lord. There is no God but He, the Beneficent, the Merciful (2:163) \"(Of the signs of His existence are the creation of heavens and earth, the alternation of nights and days, the ships that sail in the sea for the benefit of the people. (Also of such signs are) the water that God sends from the sky to revive the dead earth where He has scattered all kinds of animals, the winds of all directions and the clouds that are rendered for service between the sky and the earth. Such are evidence (of His existence) for those who use their intelligence. (2: 164) \"O Hisham, Allah has mentioned the above facts as proof of His existence and that such facts depend upon the will of one who has designed them saying: \"God has made the day and the night, the sun and the moon, and all the stars subservient to you by His command. In this there is evidence of the truth for people of understanding. (16:12) \"It is He, Who created you from clay, turning it into a living germ, then into a clot of blood, and then brings you forth as a child. He then made you grow into manhood and become old. He causes some of you to live for the appointed time and some of you to die before so that perhaps you may have understanding (40:67). \"In the heavens and the earth there is evidence (of the Truth) for the believers (45:3). In your creation and in that of the beasts living on earth there is evidence of the Truth for the people who have strong faith (45:4). In the alternation of the night and the day, the sustenance which God has sent down from the sky to revive the barren earth, and in the changing of the direction of the winds there is evidence of the truth for the people of understanding (45:5). \"Know that God brings the dead earth back to life. We have explained Our revelations to you so that you may perhaps have understanding (57:17). \"In the earth there are adjacent pieces of land, vineyards, farms, date-palms of single and many roots which are all watered by the same water. We have made some yield a better food than others. All this is evidence (of the existence of God) for the people who understand. (13:4) \"Also, of the evidence of His existence are His showing you lightening which gives you fear and hope and His sending water down from the sky which revives the earth after its death. In this there is evidence (of the truth) for the people of understanding. (30:24) \"(Muhammad), say, \"Let me tell you about what your Lord has commanded: Do not consider anything equal to God; Be kind to your parents; Do not murder your children out of fear of poverty, for We give sustenance to you and to them. Do not even approach indecency either in public or in private. Take not a life, which God has made sacred except by way of justice and law. Thus does He command you that you may learn wisdom. (6:151) \"God has told you this parable about yourselves: Could your slaves share your wealth equally with you and could you fear them as you fear yourselves? Thus, do We clarify the evidence (of the truth) for the people of understanding (30:28). \"O Hisham, Allah then has given good advise to the people of intelligence and has encouraged them to become interested in the life to come saying, \"The worldly life is but useless amusement and sport (compared to) the life hereafter which is far better and is only for the pious. Will you not then understand? (6:32) \"O Hisham, Allah then has given warnings to those who do not think about the punishment that may come upon them from Allah saying, \"Then We totally destroyed the others (37:136). You pass by (their ruined town) in the morning and at night (37:137). Will you then not understand? (37:138) \"We will bring torment from the sky on this town because of the evil-deeds of its inhabitants\" (29:34). We left manifest evidence (of the truth) there for the people of understanding. (29:35) \"O Hisham, intelligence comes with knowledge.\" Allah has said, \"These are parables which, We tell to human beings, but only the learned ones understand them. (29:43) \"O Hisham, Allah has then expressed dislike towards those who do not understand in the following words: \"When certain people are asked to follow the revelations of God, they say, 'We would rather follow what our fathers have followed,' even though their fathers had no understanding and could not find the true guidance (2:170) \"Preaching to unbelievers is like talking to someone who cannot hear anything except yells and shouts. They are deaf, dumb, and blind; they have no understanding. (2:171) \"Some of them will look at you, but are you supposed to guide the blind even if they have no vision? (10:43) \"Do you think that most of them listen and understand? They are like cattle or even more, straying and confused. (25:44) \"They will not fight you united except with the protection of fortified towns or from behind walls. They are strong among themselves. You think that they are united, but in fact, their hearts are divided. They are a people who have no understanding (59:14) \"Would you order people to do good deeds and forget to do them yourselves even though you read the Book? Why do you not think?\" (2:44) \"O Hisham, Allah then has expressed dislike towards the multitudes saying, \"Most of the people in the land will lead you away from God's guidance if you follow them; they only follow their own conjecture and preach falsehood (6: 116) \"If you ask them, \"Who has created the heavens and the earth,\" they will certainly say, \"God has created them.\" Say, \"It is only God who deserves all praise, but most of them do not know\" (31:25) \"If you ask them, \"Who has sent down water from the sky to revive the dead earth?\" They will say, \"God has done it.\" Say, \"It is only God who deserves all praise, but many of them do not understand.\" (29:63) \"O Hisham, Allah then has praised those fewer in numbers saying, \"Only few of my servants are grateful.\" (34:13) He has said, \"How few are they?\" \"A believing person from the people of the Pharaoh who concealed his faith said, \"Would you kill a man just because he says God is my Lord?\" (40:28) \"No one believed in him, except a few. (1 1:40) Tell them, (Muhammad), \"God certainly has the Power to show such miracles but many of them are ignorant.\" (6:37). \"Many of them have no understanding. (5:103) Many of them do not realize.\" \"O Hisham, Allah has mentioned the people of intelligence in the best manners with the best of characteristics saying, \"God gives wisdom to the ones whom He wants. Whoever is given wisdom, has, certainly, received much good. Only people of intelligence can grasp this (2:269). \"... those who have a firm grounding in knowledge say, \"We believe in it. All its verses are from our Lord.\" No one can grasp this fact except the people of Intelligence . . .\" (3:7) \"The creation of the heavens and the earth and the alternation of the day and the night are evidence (of the existence of God) for people of Intelligence. (3:190) \"Can a person, who knows that what is revealed to you from your Lord is the truth, be considered equal to a blind person? Only those who have understanding take heed (13:19). \"Can this one be considered equal to one who worships God during the night, prostrating and standing, who has fear of the Day of Judgment, and who has hope in the mercy of his Lord? Say, \"Are those who know equal to those who do not know? Only the people of Intelligence take heed\" (39:9). \"It is a blessed Book which We have revealed for you so that you will reflect upon its verses and so the people of understanding will take heed (38:29). \"To Moses We had given guidance and to the children of Israel We had given the Book (40:53) as their inheritance and as a guide and a reminder to the people of understanding (40:54) \"Keep on reminding them. This benefits the believers\" (51:55). \"O Hisham, Allah says in His book, \"This is a reminder for the ones who understands, listens, and sees.\" (50:37) It means intelligence. \"We gave wisdom to Luqman so that he would give thanks to God . ...\" (31:12) Understand is intelligence. \"O Hisham, Luqman said to his son, \" Venerate the truth you will be the most intelligent among man. Cleverness before intelligence has a very small value. My son, the world is a very deep ocean in which many people have drowned. You must take piety before God as the ship, faith as supplies therein, trust in God as the sales, intelligence as the captain, knowledge as the guide and patience as passengers.\" \"O Hisham, for everything there is a guide. The guide for intelligence is thinking. The guide for thinking is silence. For everything there is a means for mobility the means of mobility for intelligence is humble attitude. To disobey a prohibition is enough proof of ones ignorance. \"O Hisham, Allah send His messengers to people for no other reason but that they would have understanding about Him. Those who obey Him better have better understanding about Him. Those who are more knowledgeable in the commandment of Allah are the ones who have more powerful intelligence and those who have more powerful intelligence are at a higher degree of excellence in this world and in the next life. \"O Hisham, Allah has placed two kinds of authority over man. 1 The apparent and manifest authority and the internal and hidden authority The prophets and messengers are the apparent and manifest authorities and intelligence is the hidden and internal authority. \"O Hisham, a man of intelligence is one whose thankfulness doe not diminish because of a large wealth and prohibited matters can not overpower his patience. \"O Hisham, one who would support three things against an other three kinds of things he would be leading to the destruction of his own intelligence. (1) Darkening of one's ability to think with day dreaming, (2) the abolishment of the sparks of one's wisdom with excessive bluffs and (3) the extinguishing of the lights of the lessons from experience by the desires of one's soul. It would be like supporting ones desire to destroy ones own intelligence. One who would destroy his own intelligence he has destroyed his own worldly life as well as the life to come. \"O Hisham how would you expect to have pure deeds before Allah when you have such things that keep you away from the facts that matter to Allah, your Lord, and you have obeyed your desires against your own intelligence. \"O Hisham, maintaining patience in loneliness is a sign of the strength of intelligence. One who has understanding about Allah he keeps himself aside from the people of this world and those interested in it. He becomes interested in what is with Allah. Allah then gives him comfort in his fear and company when he is lonely. Allah gives him riches in his poverty and honor without the existence of his tribesmen. \"O Hisham, truth is set up so that Allah is obeyed. There is no salvation without obedience to Allah. Obedience comes only from knowledge, which comes from learning that receives strength from intelligence. The only knowledge of value is that of one who knows about the Lord and intelligence discerns the valuable of knowledge. \"O Hisham, smaller degrees of deeds with knowledge are accepted with double value and large amounts of deeds from those who follow their desires and ignorance are rejected. \"O Hisham, a person of intelligence is pleased with little things of the world with wisdom but he does not agree with a little wisdom with all of the world and, thus, such people strike a gainful bargain. \"O Hisham, the people of intelligence stay away from what is more than the basic necessities of life how then they would not stay away from the sins in this world. To stay away from what is more than the bare necessities is only extra virtue but staying away from sins is obligatory. \"O Hisham, a man of intelligence observes the world and the people of the world and finds out that the worldly gains come only through hard works and labor. He finds out that gains of the life hereafter also come through hard work and labor he then accepts the one that is more durable. \"O Hisham, people of intelligence hold themselves back from the worldly things and strengthen interest in the gains of the life hereafter. They have learned that the worldly gains are sought after and are wanted and so also are the gains of the lifer hereafter. One who seeks the gains of the life hereafter the world will seek him to deliver to him his livelihood but one who seeks the worldly gains the hereafter would also seek to find him. Death will then approach him and it will destroy his world and leave him with no opportunity in the life hereafter (because he had gained nothing). \"O Hisham, one who wants self-sufficiency without property, comfort for his heart from the evil of jealousy and the safety of his religion he should pray to Allah, the Most Glorious, to perfect his intelligence. The person of intelligence is satisfied with the basic necessities and one who agrees with basic necessities he is self-sufficient and free of needs and one who is not satisfied with basic necessities he is never free from wants. \"O Hisham, Allah has stated the following on behalf of the people of virtue, \"They say, \"Lord, do not cause our hearts to deviate from Your guidance, and grant us mercy. You are the Most Awarding One.\" (3:8) They know that hearts may deviate and turn towards blindness and destruction. It is certain that those who do not fear Allah have no understanding about Him. One who does not have proper understanding about Allah one's heart does not establish any stable gnosis about Allah with clear awareness of such gnosis that one would find in his heart. No one can be as such except those whose deeds would confirm their words and their privacy would agree with their public activities. This is because Allah, Sacrosanct are whose names, has not shown what is private and unknown form intelligence except through what is public from it and speaks for it. \"O Hisham, the commander of the true believers, Imam Ali (a.s) has said, \"Allah is worshipped better by no means other than intelligence. No one's intelligence reaches perfection until therewith is found various qualities. Disbelief and evil should not emerge therefrom. Wisdom and goodness should be expected to exist therewith. The extra of the property of a person of intelligence is given in charity, the extra of his words is restrained and his share of the worldly things is only the basic necessities. He never considers himself as to have learned enough. To be with Allah, although in a very humble state, is far better to him than to live very much honored with others. Humbleness is more beloved to him than being taken as a dignitary. He considers virtuous deeds of others a great deal and his own virtuous deeds as insignificant. He considers all the other people better than his self and his own self as the worse of all and this is the totality of all things.\" \"O Hisham, a man of intelligence never speaks a lie even though it may satisfy his desires.\" \"O Hisham, one who does not maintain honorable kindness he has no religion and one can not have such noble character without intelligence. A person of the greatest value among people is one who does not consider the worldly gains his fortune. Nothing can become an adequate price for your bodies other than paradise. Do not sell it for any thing other than paradise. \"O Hisham, the commander of the true believers, Imam Ali (a.s) has said, \"Three noble qualities in man are of the signs of the existence of intelligence. He replies when questioned and he speaks up only when everyone else fails to speak and offers his advise when it is beneficial to his people. One who has none of these qualities is a fool.\" He also has said, \"No one other a person who has all of the above or some of such qualities should chair a gathering and if one does so without any of such qualities he is a fool.\" Imam Hassan ibn Ali (a.s) has said, \"If you would ask for help do so from a proper source.\" He was asked, \"O grandson of the holy Prophet, 'Who are the proper sources?\" He replied, \"They are those about whom Allah has spoken in His book saying, \"Only those who have understanding will take heed and they are the people of intelligence.\" Imam Ali ibn al-Husayn (a.s) has said, \"Sitting in the company of virtuous people leads one to virtue and association with the scholars is a means of strengthening one's intelligence. Obedience to the authorities that practice justice is an honor. The investment of wealth for profit is a dignifying practice. Guiding one who asks for guidance is an expression of gratitude. To restrain ones harmful manners and deeds is because of the perfection of one's intelligence in which there is comfort for the body in the short and long terms.\" \"O Hisham, a man of intelligence does not speak to one who is feared to call him a liar. He does not ask those that he fears may deny him. He does not count on what is not within his abilities. He does not maintain any hope in that which may involve severity and harshness. He does not take any steps towards which he fears may not be achieved due to his inability.\" H 13, Ch. 1, h 13 Ali ibn Muhammad has narrated from Sahl ibn Ziyad in a marfu' manner Amir al-Mu'minin Ali (a.s) who has said the following. \"Intelligence is a complete cover (protection) for one and extra knowledge and skills are evident beauty Compensate your physical shortcomings with your extra knowledge and skills. Fight your desires with help from your intelligence and in so doing friendship is surrendered to and love becomes manifest for you.\"",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "7th Imam, Musa ibn Ja'far"
    },
    {
        "book": "Al-Kafi",
        "number": "13",
        "chapter": "1",
        "part": "1",
        "volume": "",
        "transmission_chain": [
            "Sahl ibn Ziyad",
            "Ali ibn Muhammad",
            "unknown"
        ],
        "tags": [
            "worship",
            "intelligence",
            "tafsir"
        ],
        "hadith": {
            "arabic": "",
            "translations": [
                {
                    "english": "\"Allah has not distributed anything among people more excellent than intelligence. The sleeping of a person of intelligence is better than the worshipping of an ignorant person for the whole night. Staying of a person of intelligence at home is better than the journeying of an ignorant person in search for success and good deeds. Allah did not sent any prophet or messenger before the completion of his intelligence and to let it become better than the intelligence of all of his followers. Whatever a prophet preserves in his soul is better than the achievement of all the striving people for virtue and good deeds. People would not fulfil their obligations to Allah without having an understanding about Him. All the worshippers will not be able to achieve with the virtue of their worships what a person of intelligence achieves. It is the people of intelligence who are considered as people of proper understanding in chapter 2:269 of the holy Quran, \"Only People of understanding realizes this.\" ",
                    "rationale": ""
                }
            ]
        },
        "gradings": [
            {
                "grader": "",
                "rationale": ""
            }
        ],
        "present_day_location": "",
        "date": "",
        "source": "The Holy Prophet (saw)"
    }
]